name: "ST_vgg_to_alexnet_hha"
input: "da_data"
input_shape {
  dim: 1
  dim: 3
  dim: 227
  dim: 227
}

layer {
  name: "da_conv1" type: "Convolution" bottom: "da_data" top: "da_conv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 96 kernel_size: 11 pad: 7 stride: 4
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 } 
  }
}
layer {
  name: "da_relu1" type: "ReLU" bottom: "da_conv1" top: "da_conv1"
}
layer {
  name: "da_pool1" type: "Pooling" bottom: "da_conv1" top: "da_pool1"
  pooling_param { pool: MAX kernel_size: 3 pad: 0 stride: 2 }
}
layer {
  name: "da_norm1" type: "LRN" bottom: "da_pool1" top: "da_norm1"
  lrn_param { local_size: 5 alpha: 0.0001 beta: 0.75 }
}
layer {
  name: "da_conv2" type: "Convolution" bottom: "da_norm1" top: "da_conv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 kernel_size: 5 pad: 2 stride: 1 group: 2 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 1 } 
  }
}
layer { 
  name: "da_relu2" type: "ReLU" bottom: "da_conv2" top: "da_conv2" 
}
layer {
  name: "da_pool2" type: "Pooling" bottom: "da_conv2" top: "da_pool2"
  pooling_param { pool: MAX kernel_size: 3 pad: 0 stride: 2 }
}
layer {
  name: "da_norm2" type: "LRN" bottom: "da_pool2" top: "da_norm2"
  lrn_param { local_size: 5 alpha: 0.0001 beta: 0.75 }
}
layer {
  name: "da_conv3" type: "Convolution" bottom: "da_norm2" top: "da_conv3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 384 kernel_size: 3 pad: 1 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 } 
  }
}
layer {
  name: "da_relu3" type: "ReLU" bottom: "da_conv3" top: "da_conv3" 
}
layer {
  name: "da_conv4" type: "Convolution" bottom: "da_conv3" top: "da_conv4"
  param { lr_mult: 1 decay_mult: 1}
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 384 kernel_size: 3 pad: 1 stride: 1 group: 2 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 1 } 
  }
}
layer {
  name: "da_relu4" type: "ReLU" bottom: "da_conv4" top: "da_conv4"
}
layer {
  name: "da_conv5" type: "Convolution" bottom: "da_conv4" top: "da_conv5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 kernel_size: 3 pad: 1 stride: 1 group: 2 
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 1 } 
  }
}
layer {
  name: "da_relu5" type: "ReLU" bottom: "da_conv5" top: "da_conv5"
}
layer {
  name: "da_pool5" type: "Pooling" bottom: "da_conv5" top: "da_pool5"
  pooling_param { pool: MAX kernel_size: 3 stride: 2 pad: 0}
}
